Revit 2026 API

# ReferenceIntersector Methods

---

The ReferenceIntersector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Find | Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria. |
|  | FindNearest | Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria. |
|  | GetFilter | Gets the ElementFilter used in intersection testing. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTargetElementIds | Gets the set of ElementIds to test from in intersection testing. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFilter | Sets the ElementFilter used in intersection testing. |
|  | SetTargetElementIds |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ReferenceIntersector Class

Autodesk.Revit.DB Namespace